<details ><summary>plan for services_platform_notification_prod_us-east-1 2025-12-19 09:55:16 (UTC)</summary>
          <details ><summary>Additional output for <b>ealebed/digger-poc#services_platform_notification_prod_us-east-1</b></summary>

```terraform
Project: main-dev

 Name                                             Monthly Qty  Unit                    Monthly Cost   
                                                                                                      
 module.s3_bucket.aws_s3_bucket.self                                                                  
 └─ Standard                                                                                          
    ├─ Storage                              Monthly cost depends on usage: $0.023 per GB              
    ├─ PUT, COPY, POST, LIST requests       Monthly cost depends on usage: $0.005 per 1k requests     
    ├─ GET, SELECT, and all other requests  Monthly cost depends on usage: $0.0004 per 1k requests    
    ├─ Select data scanned                  Monthly cost depends on usage: $0.002 per GB              
    └─ Select data returned                 Monthly cost depends on usage: $0.0007 per GB             
                                                                                                      
 Project total                                                                                $0.00   

──────────────────────────────────
Project: main-prod

 Name                                             Monthly Qty  Unit                    Monthly Cost   
                                                                                                      
 module.s3_bucket.aws_s3_bucket.self                                                                  
 └─ Standard                                                                                          
    ├─ Storage                              Monthly cost depends on usage: $0.023 per GB              
    ├─ PUT, COPY, POST, LIST requests       Monthly cost depends on usage: $0.005 per 1k requests     
    ├─ GET, SELECT, and all other requests  Monthly cost depends on usage: $0.0004 per 1k requests    
    ├─ Select data scanned                  Monthly cost depends on usage: $0.002 per GB              
    └─ Select data returned                 Monthly cost depends on usage: $0.0007 per GB             
                                                                                                      
 Project total                                                                                $0.00   

──────────────────────────────────
Project: main-qa

 Name                                             Monthly Qty  Unit                    Monthly Cost   
                                                                                                      
 module.s3_bucket.aws_s3_bucket.self                                                                  
 └─ Standard                                                                                          
    ├─ Storage                              Monthly cost depends on usage: $0.023 per GB              
    ├─ PUT, COPY, POST, LIST requests       Monthly cost depends on usage: $0.005 per 1k requests     
    ├─ GET, SELECT, and all other requests  Monthly cost depends on usage: $0.0004 per 1k requests    
    ├─ Select data scanned                  Monthly cost depends on usage: $0.002 per GB              
    └─ Select data returned                 Monthly cost depends on usage: $0.0007 per GB             
                                                                                                      
 Project total                                                                                $0.00   

 OVERALL TOTAL                                                                               $0.00 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
15 cloud resources were detected:
∙ 3 were estimated
∙ 12 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main-dev                                           ┃         $0.00 ┃           - ┃      $0.00 ┃
┃ main-prod                                          ┃         $0.00 ┃           - ┃      $0.00 ┃
┃ main-qa                                            ┃         $0.00 ┃           - ┃      $0.00 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: main-dev

+ module.s3_bucket.aws_s3_bucket.self
  Monthly cost depends on usage

    + Standard
    
        + Storage
          Monthly cost depends on usage
            +$0.023 per GB
    
        + PUT, COPY, POST, LIST requests
          Monthly cost depends on usage
            +$0.005 per 1k requests
    
        + GET, SELECT, and all other requests
          Monthly cost depends on usage
            +$0.0004 per 1k requests
    
        + Select data scanned
          Monthly cost depends on usage
            +$0.002 per GB
    
        + Select data returned
          Monthly cost depends on usage
            +$0.0007 per GB

Monthly cost change for ealebed/digger-poc/services/platform/notification-dev
Amount:  $0.00 ($0.00 → $0.00)

──────────────────────────────────
Project: main-prod

+ module.s3_bucket.aws_s3_bucket.self
  Monthly cost depends on usage

    + Standard
    
        + Storage
          Monthly cost depends on usage
            +$0.023 per GB
    
        + PUT, COPY, POST, LIST requests
          Monthly cost depends on usage
            +$0.005 per 1k requests
    
        + GET, SELECT, and all other requests
          Monthly cost depends on usage
            +$0.0004 per 1k requests
    
        + Select data scanned
          Monthly cost depends on usage
            +$0.002 per GB
    
        + Select data returned
          Monthly cost depends on usage
            +$0.0007 per GB

Monthly cost change for ealebed/digger-poc/services/platform/notification-prod
Amount:  $0.00 ($0.00 → $0.00)

──────────────────────────────────
Project: main-qa

+ module.s3_bucket.aws_s3_bucket.self
  Monthly cost depends on usage

    + Standard
    
        + Storage
          Monthly cost depends on usage
            +$0.023 per GB
    
        + PUT, COPY, POST, LIST requests
          Monthly cost depends on usage
            +$0.005 per 1k requests
    
        + GET, SELECT, and all other requests
          Monthly cost depends on usage
            +$0.0004 per 1k requests
    
        + Select data scanned
          Monthly cost depends on usage
            +$0.002 per GB
    
        + Select data returned
          Monthly cost depends on usage
            +$0.0007 per GB

Monthly cost change for ealebed/digger-poc/services/platform/notification-qa
Amount:  $0.00 ($0.00 → $0.00)

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

15 cloud resources were detected:
∙ 3 were estimated
∙ 12 were free

```
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.self will be created
  + resource "aws_s3_bucket" "self" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tf-demo-notification-531438381462-notification-prod-us-east-1"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_lifecycle_configuration.self will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "self" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "abort-incomplete-mpu"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.self will be created
  + resource "aws_s3_bucket_public_access_block" "self" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_server_side_encryption_configuration.self will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "self" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "alias/aws/s3"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_bucket.aws_s3_bucket_versioning.self will be created
  + resource "aws_s3_bucket_versioning" "self" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```
</details>


<details ><summary>Terraform plan validation check (services_platform_notification_prod_us-east-1)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                  RESOURCE                                  |
|--------|----------------------------------------------------------------------------|
| add    | `module.s3_bucket.aws_s3_bucket.self`                                      |
|        | `module.s3_bucket.aws_s3_bucket_lifecycle_configuration.self`              |
|        | `module.s3_bucket.aws_s3_bucket_public_access_block.self`                  |
|        | `module.s3_bucket.aws_s3_bucket_server_side_encryption_configuration.self` |
|        | `module.s3_bucket.aws_s3_bucket_versioning.self`                           |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p services_platform_notification_prod_us-east-1
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>